#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# (c) @AlbertEinsteinTG

class Translation(object):
    
    START_TEXT = """<b>ഹേയ് {} 😛 

വെറുതെ start കുത്തി കളിക്കരുത്. സിനിമയുടെ ലിങ്ക് ആണ് വേണ്ടതെങ്കിൽ <a href='https://t.me/+z8zb9jaASo81MDdl'>ഈ ഗ്രൂപ്പിൽ</a> സിനിമയുടെ പേര് ടൈപ്പ് ചെയ്യ്, അപ്പോൽ ഞാൻ ലിങ്ക് തരാം എന്നിട്ട് ഇവിടെ വന്ന് start കൊടുക്കണം😜
ഇനി ഇനേക്കൊണ്ട് വീണ്ടും വീണ്ടും പറയിപ്പിക്കരുത്. 🤷‍♂</b>

<i>താഴെ കാണുന്ന രണ്ട് ചാനലുകളിലും ജോയിൻ ചെയ്യാൻ മറക്കരുതേ...🦧</i>"""    
    
    HELP_TEXT = """
<b>സിനിമയുടെ ലിങ്ക് ആണ് വേണ്ടതെങ്കിൽ <a href='https://t.me/Pushpa_Minnal_murali_2021'>ഈ ഗ്രൂപ്പിൽ</a> സിനിമയുടെ പേര് ടൈപ്പ് ചെയ്യ്, അപ്പോൽ ഞാൻ ലിങ്ക് തരാം എന്നിട്ട് ഇവിടെ വന്ന് start കൊടുക്കണം😜
ഇനി ഇനേക്കൊണ്ട് വീണ്ടും വീണ്ടും പറയിപ്പിക്കരുത്. 🤷‍♂</b>
"""
    
    ABOUT_TEXT = """<b>You know, I'm always different🙄🙄</b>
"""
